Revit 2024 API
DirectShapeRoomBoundingOption Enumeration
 An enumerated type containing possible room bounding settings for DirectShapes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum DirectShapeRoomBoundingOption
Visual Basic
Public Enumeration DirectShapeRoomBoundingOption
Visual C++
public enum class DirectShapeRoomBoundingOption
Members
Member name | Description
NotApplicable |  The associated DirectShape doesn't have a room bounding parameter, and isn't allowed to. Trying to change to this value will result in an exception. Trying to change from this value is restricted to DirectShapes that can be room bounding.
SetByParameter |  The associated DirectShape has a room bounding parameter which is which is writeable and defaults to on. If can be toggled by a user or the API (by accessing the parameter WALL_ATTR_ROOM_BOUNDING).
See Also
Autodesk.Revit.DB Namespace